In [24]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score
import datetime as dt

In [23]:
# Reading in the provided CSV file into a pandas DataFrame
df = pd.read_csv("C:/Users/perry/OneDrive/Desktop/MyRepos/project4-team1/data files/Metro_zhvi_uc_sfrcondo_tier_0.33_0.67_sm_sa_month.csv")

# Display the first few rows of the DataFrame to ensure it's loaded correctly
df.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-10-31,2022-11-30,2022-12-31,2023-01-31,2023-02-28,2023-03-31,2023-04-30,2023-05-31,2023-06-30,2023-07-31
0,102001,0,United States,country,NaN,115215.060987,115417.693632,115668.835076,116207.361953,116827.017306,...,342893.791055,342019.278670,340897.172975,340243.409003,340186.438102,341377.341047,342529.876118,344118.510057,346019.054142,348126.180542
1,394913,1,"New York, NY",msa,NY,188937.406428,189741.459747,190551.713646,192192.721840,193888.790935,...,599230.535882,597398.651335,594922.993370,594887.333828,596112.580353,600050.039046,603155.817763,607323.863650,612506.387816,618653.073765
2,753899,2,"Los Angeles, CA",msa,CA,223645.274156,224472.515292,225577.803520,227796.103768,230229.751861,...,901388.388599,897672.540460,893323.330406,884961.557044,874796.651896,867473.497311,865273.506397,868900.838953,876737.860960,889296.983779
3,394463,3,"Chicago, IL",msa,IL,144553.677041,144690.734658,144948.658674,145591.296092,146362.956233,...,295984.602121,295278.942974,294593.348603,295177.666600,296265.508630,298199.210375,299544.045369,301304.103648,303807.012258,306516.933358
4,394514,4,"Dallas, TX",msa,TX,129710.334780,129775.242966,129848.594994,130032.097809,130266.530240,...,380982.324430,379062.994766,376514.698150,373917.253527,371811.542961,371082.877106,370740.713883,371147.729712,372189.451235,373555.542026

In [4]:
df.columns.tolist()

['RegionID',
 'SizeRank',
 'RegionName',
 'RegionType',
 'StateName',
 '2000-01-31',
 '2000-02-29',
 '2000-03-31',
 '2000-04-30',
 '2000-05-31',
 '2000-06-30',
 '2000-07-31',
 '2000-08-31',
 '2000-09-30',
 '2000-10-31',
 '2000-11-30',
 '2000-12-31',
 '2001-01-31',
 '2001-02-28',
 '2001-03-31',
 '2001-04-30',
 '2001-05-31',
 '2001-06-30',
 '2001-07-31',
 '2001-08-31',
 '2001-09-30',
 '2001-10-31',
 '2001-11-30',
 '2001-12-31',
 '2002-01-31',
 '2002-02-28',
 '2002-03-31',
 '2002-04-30',
 '2002-05-31',
 '2002-06-30',
 '2002-07-31',
 '2002-08-31',
 '2002-09-30',
 '2002-10-31',
 '2002-11-30',
 '2002-12-31',
 '2003-01-31',
 '2003-02-28',
 '2003-03-31',
 '2003-04-30',
 '2003-05-31',
 '2003-06-30',
 '2003-07-31',
 '2003-08-31',
 '2003-09-30',
 '2003-10-31',
 '2003-11-30',
 '2003-12-31',
 '2004-01-31',
 '2004-02-29',
 '2004-03-31',
 '2004-04-30',
 '2004-05-31',
 '2004-06-30',
 '2004-07-31',
 '2004-08-31',
 '2004-09-30',
 '2004-10-31',
 '2004-11-30',
 '2004-12-31',
 '2005-01-31',
 '2005-02-28',
 '2005-03-31',
 '2005-04-30',
 '2005-05-31',
 '2005-06-30',
 '2005-07-31',
 '2005-08-31',
 '2005-09-30',
 '2005-10-31',
 '2005-11-30',
 '2005-12-31',
 '2006-01-31',
 '2006-02-28',
 '2006-03-31',
 '2006-04-30',
 '2006-05-31',
 '2006-06-30',
 '2006-07-31',
 '2006-08-31',
 '2006-09-30',
 '2006-10-31',
 '2006-11-30',
 '2006-12-31',
 '2007-01-31',
 '2007-02-28',
 '2007-03-31',
 '2007-04-30',
 '2007-05-31',
 '2007-06-30',
 '2007-07-31',
 '2007-08-31',
 '2007-09-30',
 '2007-10-31',
 '2007-11-30',
 '2007-12-31',
 '2008-01-31',
 '2008-02-29',
 '2008-03-31',
 '2008-04-30',
 '2008-05-31',
 '2008-06-30',
 '2008-07-31',
 '2008-08-31',
 '2008-09-30',
 '2008-10-31',
 '2008-11-30',
 '2008-12-31',
 '2009-01-31',
 '2009-02-28',
 '2009-03-31',
 '2009-04-30',
 '2009-05-31',
 '2009-06-30',
 '2009-07-31',
 '2009-08-31',
 '2009-09-30',
 '2009-10-31',
 '2009-11-30',
 '2009-12-31',
 '2010-01-31',
 '2010-02-28',
 '2010-03-31',
 '2010-04-30',
 '2010-05-31',
 '2010-06-30',
 '2010-07-31',
 '2010-08-31',
 '2010-09-30',
 '2010-10-31',
 '2010-11-30',
 '2010-12-31',
 '2011-01-31',
 '2011-02-28',
 '2011-03-31',
 '2011-04-30',
 '2011-05-31',
 '2011-06-30',
 '2011-07-31',
 '2011-08-31',
 '2011-09-30',
 '2011-10-31',
 '2011-11-30',
 '2011-12-31',
 '2012-01-31',
 '2012-02-29',
 '2012-03-31',
 '2012-04-30',
 '2012-05-31',
 '2012-06-30',
 '2012-07-31',
 '2012-08-31',
 '2012-09-30',
 '2012-10-31',
 '2012-11-30',
 '2012-12-31',
 '2013-01-31',
 '2013-02-28',
 '2013-03-31',
 '2013-04-30',
 '2013-05-31',
 '2013-06-30',
 '2013-07-31',
 '2013-08-31',
 '2013-09-30',
 '2013-10-31',
 '2013-11-30',
 '2013-12-31',
 '2014-01-31',
 '2014-02-28',
 '2014-03-31',
 '2014-04-30',
 '2014-05-31',
 '2014-06-30',
 '2014-07-31',
 '2014-08-31',
 '2014-09-30',
 '2014-10-31',
 '2014-11-30',
 '2014-12-31',
 '2015-01-31',
 '2015-02-28',
 '2015-03-31',
 '2015-04-30',
 '2015-05-31',
 '2015-06-30',
 '2015-07-31',
 '2015-08-31',
 '2015-09-30',
 '2015-10-31',
 '2015-11-30',
 '2015-12-31',
 '2016-01-31',
 '2016-02-29',
 '2016-03-31',
 '2016-04-30',
 '2016-05-31',
 '2016-06-30',
 '2016-07-31',
 '2016-08-31',
 '2016-09-30',
 '2016-10-31',
 '2016-11-30',
 '2016-12-31',
 '2017-01-31',
 '2017-02-28',
 '2017-03-31',
 '2017-04-30',
 '2017-05-31',
 '2017-06-30',
 '2017-07-31',
 '2017-08-31',
 '2017-09-30',
 '2017-10-31',
 '2017-11-30',
 '2017-12-31',
 '2018-01-31',
 '2018-02-28',
 '2018-03-31',
 '2018-04-30',
 '2018-05-31',
 '2018-06-30',
 '2018-07-31',
 '2018-08-31',
 '2018-09-30',
 '2018-10-31',
 '2018-11-30',
 '2018-12-31',
 '2019-01-31',
 '2019-02-28',
 '2019-03-31',
 '2019-04-30',
 '2019-05-31',
 '2019-06-30',
 '2019-07-31',
 '2019-08-31',
 '2019-09-30',
 '2019-10-31',
 '2019-11-30',
 '2019-12-31',
 '2020-01-31',
 '2020-02-29',
 '2020-03-31',
 '2020-04-30',
 '2020-05-31',
 '2020-06-30',
 '2020-07-31',
 '2020-08-31',
 '2020-09-30',
 '2020-10-31',
 '2020-11-30',
 '2020-12-31',
 '2021-01-31',
 '2021-02-28',
 '2021-03-31',
 '2021-04-30',
 '2021-05-31',
 '2021-06-30',
 '2021-07-31',
 '2021-08-31',
 '2021-09-30',
 '2021-10-31',
 '2021-11-30',
 '2021-12-31',
 '2022-01-31',
 '2022-02-28',
 '2022-03-31',
 '2022-04-30',
 '2022-05-31',
 '2022-06-30',
 '2022-07-31',
 '2022-08-31',
 '2022-09-30',
 '2022-10-31',
 '2022-11-30',
 '2022-12-31',
 '2023-01-31',
 '2023-02-28',
 '2023-03-31',
 '2023-04-30',
 '2023-05-31',
 '2023-06-30',
 '2023-07-31']

In [5]:
df_texas = df[df['StateName'] == 'TX'].reset_index(drop=True)
df_texas

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-10-31,2022-11-30,2022-12-31,2023-01-31,2023-02-28,2023-03-31,2023-04-30,2023-05-31,2023-06-30,2023-07-31
0,394514,4,"Dallas, TX",msa,TX,129710.334780,129775.242966,129848.594994,130032.097809,130266.530240,...,380982.324430,379062.994766,376514.698150,373917.253527,371811.542961,371082.877106,370740.713883,371147.729712,372189.451235,373555.542026
1,394692,5,"Houston, TX",msa,TX,117858.436371,117877.227624,117792.538671,117837.439149,117880.213666,...,306655.396659,305987.510919,304620.156151,303030.090257,301838.210845,301812.623565,302016.741850,302472.900748,303190.474913,304175.451550
2,395055,24,"San Antonio, TX",msa,TX,108221.122047,108322.840853,108402.254879,108551.915169,108064.245052,...,295637.332632,294769.291115,293397.751111,292229.318734,291514.314156,292002.817575,292217.274551,292430.885633,292751.489731,293180.097386
3,394355,29,"Austin, TX",msa,TX,170816.633165,171376.230751,171884.569134,172693.585774,173303.117323,...,516375.957385,508876.545247,500956.994636,493919.661978,488412.655794,485186.865440,482588.245192,480748.668196,479755.721854,478709.567809
4,394843,67,"McAllen, TX",msa,TX,NaN,NaN,NaN,NaN,NaN,...,169950.201592,170384.235159,170625.923322,170600.634714,170848.336028,171620.312808,172772.410541,173984.700992,174818.987324,175374.200891
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62,395142,933,"Sweetwater, TX",msa,TX,NaN,NaN,NaN,NaN,NaN,...,102368.050899,101965.246648,101635.525671,102845.721777,104408.238797,106496.938453,107010.180651,108180.329122,109395.392107,111378.390234
63,394968,934,"Pecos, TX",msa,TX,NaN,NaN,NaN,NaN,NaN,...,148727.947752,144432.353368,139578.673103,142564.379987,146526.014266,153432.998889,154260.904544,156366.152985,155809.139170,154695.054038
64,753929,935,"Zapata, TX",msa,TX,NaN,NaN,NaN,NaN,NaN,...,112780.440130,110475.643320,108936.088290,111147.260409,114540.815895,118566.510496,119695.253228,120369.618804,121049.156604,122015.188041
65,395188,938,"Vernon, TX",msa,TX,NaN,NaN,NaN,NaN,NaN,...,93666.386915,92873.235683,91377.174217,93094.920054,95531.333194,98689.509699,99340.685749,99563.064620,98473.781196,96589.790837
66,394767,939,"Lamesa, TX",msa,TX,NaN,NaN,NaN,NaN,NaN,...,92598.616016,92077.552111,91674.657459,95162.890996,98498.306870,100671.963608,98505.043049,96410.787629,93631.023426,90867.101813

In [6]:
df_dallas= df[df['RegionName'] == 'Dallas, TX'].reset_index(drop=True)
df_dallas

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-10-31,2022-11-30,2022-12-31,2023-01-31,2023-02-28,2023-03-31,2023-04-30,2023-05-31,2023-06-30,2023-07-31
0,394514,4,"Dallas, TX",msa,TX,129710.33478,129775.242966,129848.594994,130032.097809,130266.53024,...,380982.32443,379062.994766,376514.69815,373917.253527,371811.542961,371082.877106,370740.713883,371147.729712,372189.451235,373555.542026

In [20]:
# x_labels = df_dallas.columns[2:]
# plt.plot()

In [7]:
# List of cities to filter
cities_to_filter = ['San Antonio, TX', 'Austin, TX', 'Houston, TX', 'Dallas, TX', 'El Paso, TX']

# Filtering the DataFrame to retain only rows corresponding to the specified cities
df_cities = df_texas[df_texas['RegionName'].isin(cities_to_filter)]

# Displaying the first few rows of the filtered DataFrame
df_cities.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-10-31,2022-11-30,2022-12-31,2023-01-31,2023-02-28,2023-03-31,2023-04-30,2023-05-31,2023-06-30,2023-07-31
0,394514,4,"Dallas, TX",msa,TX,129710.334780,129775.242966,129848.594994,130032.097809,130266.530240,...,380982.324430,379062.994766,376514.698150,373917.253527,371811.542961,371082.877106,370740.713883,371147.729712,372189.451235,373555.542026
1,394692,5,"Houston, TX",msa,TX,117858.436371,117877.227624,117792.538671,117837.439149,117880.213666,...,306655.396659,305987.510919,304620.156151,303030.090257,301838.210845,301812.623565,302016.741850,302472.900748,303190.474913,304175.451550
2,395055,24,"San Antonio, TX",msa,TX,108221.122047,108322.840853,108402.254879,108551.915169,108064.245052,...,295637.332632,294769.291115,293397.751111,292229.318734,291514.314156,292002.817575,292217.274551,292430.885633,292751.489731,293180.097386
3,394355,29,"Austin, TX",msa,TX,170816.633165,171376.230751,171884.569134,172693.585774,173303.117323,...,516375.957385,508876.545247,500956.994636,493919.661978,488412.655794,485186.865440,482588.245192,480748.668196,479755.721854,478709.567809
5,394561,69,"El Paso, TX",msa,TX,93353.891219,93376.421634,93406.463524,93442.396478,93487.924704,...,197956.121179,198715.106062,199309.161844,200414.937722,201585.261757,203126.801825,204405.531273,205893.729025,207079.931239,207880.540945

In [8]:
# Filtering the DataFrame to retain only columns from January 2018 to the most recent date
date_columns = [col for col in df.columns if (col >= '2018-01-31')]
##filtered_columns = ['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName'] + date_columns
df_cities_filtered = df_cities[date_columns]

# Display the first few rows of the filtered DataFrame
df_cities_filtered.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-01-31,2018-02-28,2018-03-31,2018-04-30,2018-05-31,...,2022-10-31,2022-11-30,2022-12-31,2023-01-31,2023-02-28,2023-03-31,2023-04-30,2023-05-31,2023-06-30,2023-07-31
0,394514,4,"Dallas, TX",msa,TX,242891.968361,244734.313449,246523.677587,248125.311750,249649.213350,...,380982.324430,379062.994766,376514.698150,373917.253527,371811.542961,371082.877106,370740.713883,371147.729712,372189.451235,373555.542026
1,394692,5,"Houston, TX",msa,TX,203501.279445,204056.924777,204818.959046,205647.961369,206682.977759,...,306655.396659,305987.510919,304620.156151,303030.090257,301838.210845,301812.623565,302016.741850,302472.900748,303190.474913,304175.451550
2,395055,24,"San Antonio, TX",msa,TX,190361.404635,191388.501102,192302.453686,192982.207645,193669.646536,...,295637.332632,294769.291115,293397.751111,292229.318734,291514.314156,292002.817575,292217.274551,292430.885633,292751.489731,293180.097386
3,394355,29,"Austin, TX",msa,TX,305316.204598,306334.542529,307472.851125,308408.106838,309389.960284,...,516375.957385,508876.545247,500956.994636,493919.661978,488412.655794,485186.865440,482588.245192,480748.668196,479755.721854,478709.567809
5,394561,69,"El Paso, TX",msa,TX,130852.579595,131095.292025,131245.163590,131331.111332,131560.095513,...,197956.121179,198715.106062,199309.161844,200414.937722,201585.261757,203126.801825,204405.531273,205893.729025,207079.931239,207880.540945

In [9]:
# Drop non-date columns
df_dates_only = df_cities_filtered.drop(columns=["RegionID", "RegionType", "SizeRank", "StateName"])
df_dates_only

,RegionName,2018-01-31,2018-02-28,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,2018-08-31,2018-09-30,...,2022-10-31,2022-11-30,2022-12-31,2023-01-31,2023-02-28,2023-03-31,2023-04-30,2023-05-31,2023-06-30,2023-07-31
0,"Dallas, TX",242891.968361,244734.313449,246523.677587,248125.311750,249649.213350,250744.436844,251875.569650,252718.115125,253477.171817,...,380982.324430,379062.994766,376514.698150,373917.253527,371811.542961,371082.877106,370740.713883,371147.729712,372189.451235,373555.542026
1,"Houston, TX",203501.279445,204056.924777,204818.959046,205647.961369,206682.977759,207543.754387,208511.892944,209328.144634,210134.862963,...,306655.396659,305987.510919,304620.156151,303030.090257,301838.210845,301812.623565,302016.741850,302472.900748,303190.474913,304175.451550
2,"San Antonio, TX",190361.404635,191388.501102,192302.453686,192982.207645,193669.646536,194282.875753,195085.149824,195847.993943,196536.814316,...,295637.332632,294769.291115,293397.751111,292229.318734,291514.314156,292002.817575,292217.274551,292430.885633,292751.489731,293180.097386
3,"Austin, TX",305316.204598,306334.542529,307472.851125,308408.106838,309389.960284,310107.706492,311142.123858,312039.306686,312880.032482,...,516375.957385,508876.545247,500956.994636,493919.661978,488412.655794,485186.865440,482588.245192,480748.668196,479755.721854,478709.567809
5,"El Paso, TX",130852.579595,131095.292025,131245.163590,131331.111332,131560.095513,131827.536434,132322.176551,132848.980575,133369.806816,...,197956.121179,198715.106062,199309.161844,200414.937722,201585.261757,203126.801825,204405.531273,205893.729025,207079.931239,207880.540945

In [ ]:
# df_dates_only.columns[2:]
# df.at[row(integer), column_name(string)]

In [ ]:
# city = {
#     date:values as list
# }

In [15]:
# Melt the dataframe to transform it from wide to long format
melted_df = pd.melt(df_dates_only, id_vars=["RegionName"], 
                    value_vars=df_dates_only.columns[1:], 
                    var_name="Date", 
                    value_name="ZHVI")

# Display the first few rows of the melted dataframe
melted_df.head(50)

         RegionName        Date           ZHVI
0        Dallas, TX  2018-01-31  242891.968361
1       Houston, TX  2018-01-31  203501.279445
2   San Antonio, TX  2018-01-31  190361.404635
3        Austin, TX  2018-01-31  305316.204598
4       El Paso, TX  2018-01-31  130852.579595
5        Dallas, TX  2018-02-28  244734.313449
6       Houston, TX  2018-02-28  204056.924777
7   San Antonio, TX  2018-02-28  191388.501102
8        Austin, TX  2018-02-28  306334.542529
9       El Paso, TX  2018-02-28  131095.292025
10       Dallas, TX  2018-03-31  246523.677587
11      Houston, TX  2018-03-31  204818.959046
12  San Antonio, TX  2018-03-31  192302.453686
13       Austin, TX  2018-03-31  307472.851125
14      El Paso, TX  2018-03-31  131245.163590
15       Dallas, TX  2018-04-30  248125.311750
16      Houston, TX  2018-04-30  205647.961369
17  San Antonio, TX  2018-04-30  192982.207645
18       Austin, TX  2018-04-30  308408.106838
19      El Paso, TX  2018-04-30  131331.111332
20       Dallas, TX  2018-05-31  249649.213350
21      Houston, TX  2018-05-31  206682.977759
22  San Antonio, TX  2018-05-31  193669.646536
23       Austin, TX  2018-05-31  309389.960284
24      El Paso, TX  2018-05-31  131560.095513
25       Dallas, TX  2018-06-30  250744.436844
26      Houston, TX  2018-06-30  207543.754387
27  San Antonio, TX  2018-06-30  194282.875753
28       Austin, TX  2018-06-30  310107.706492
29      El Paso, TX  2018-06-30  131827.536434
30       Dallas, TX  2018-07-31  251875.569650
31      Houston, TX  2018-07-31  208511.892944
32  San Antonio, TX  2018-07-31  195085.149824
33       Austin, TX  2018-07-31  311142.123858
34      El Paso, TX  2018-07-31  132322.176551
35       Dallas, TX  2018-08-31  252718.115125
36      Houston, TX  2018-08-31  209328.144634
37  San Antonio, TX  2018-08-31  195847.993943
38       Austin, TX  2018-08-31  312039.306686
39      El Paso, TX  2018-08-31  132848.980575
40       Dallas, TX  2018-09-30  253477.171817
41      Houston, TX  2018-09-30  210134.862963
42  San Antonio, TX  2018-09-30  196536.814316
43       Austin, TX  2018-09-30  312880.032482
44      El Paso, TX  2018-09-30  133369.806816
45       Dallas, TX  2018-10-31  253918.787323
46      Houston, TX  2018-10-31  210810.396470
47  San Antonio, TX  2018-10-31  197113.873602
48       Austin, TX  2018-10-31  313643.062487
49      El Paso, TX  2018-10-31  133626.536113

In [16]:
# Create a dictionary to hold dataframes for each unique RegionName
region_dfs = {}

# Split the melted_df based on unique RegionName values
for region in melted_df['RegionName'].unique():
    region_dfs[region] = melted_df[melted_df['RegionName'] == region]

# Display the first few rows of one of the dataframes as an example
region_example = list(region_dfs.keys())[0]
region_dfs[region_example].head()

    RegionName        Date           ZHVI
0   Dallas, TX  2018-01-31  242891.968361
5   Dallas, TX  2018-02-28  244734.313449
10  Dallas, TX  2018-03-31  246523.677587
15  Dallas, TX  2018-04-30  248125.311750
20  Dallas, TX  2018-05-31  249649.213350

In [17]:
# Reset the index for each dataframe in the region_dfs dictionary
for region, df in region_dfs.items():
    region_dfs[region] = df.reset_index(drop=True)

# Display the first few rows of the "United States" dataframe as an example after resetting the index
region_dfs[region_example].head()

   RegionName        Date           ZHVI
0  Dallas, TX  2018-01-31  242891.968361
1  Dallas, TX  2018-02-28  244734.313449
2  Dallas, TX  2018-03-31  246523.677587
3  Dallas, TX  2018-04-30  248125.311750
4  Dallas, TX  2018-05-31  249649.213350

In [18]:
Austin_df = region_dfs["Austin, TX"]
Austin_df.head()

   RegionName        Date           ZHVI
0  Austin, TX  2018-01-31  305316.204598
1  Austin, TX  2018-02-28  306334.542529
2  Austin, TX  2018-03-31  307472.851125
3  Austin, TX  2018-04-30  308408.106838
4  Austin, TX  2018-05-31  309389.960284

In [19]:
Dallas_df = region_dfs["Dallas, TX"]
Dallas_df.head()

   RegionName        Date           ZHVI
0  Dallas, TX  2018-01-31  242891.968361
1  Dallas, TX  2018-02-28  244734.313449
2  Dallas, TX  2018-03-31  246523.677587
3  Dallas, TX  2018-04-30  248125.311750
4  Dallas, TX  2018-05-31  249649.213350

In [22]:
San_Antonio_df = region_dfs["San Antonio, TX"]
San_Antonio_df.head()

        RegionName        Date           ZHVI
0  San Antonio, TX  2018-01-31  190361.404635
1  San Antonio, TX  2018-02-28  191388.501102
2  San Antonio, TX  2018-03-31  192302.453686
3  San Antonio, TX  2018-04-30  192982.207645
4  San Antonio, TX  2018-05-31  193669.646536

In [21]:
El_Paso_df = region_dfs["El Paso, TX"]
El_Paso_df.head()

    RegionName        Date           ZHVI
0  El Paso, TX  2018-01-31  130852.579595
1  El Paso, TX  2018-02-28  131095.292025
2  El Paso, TX  2018-03-31  131245.163590
3  El Paso, TX  2018-04-30  131331.111332
4  El Paso, TX  2018-05-31  131560.095513